[
  {
    "id": "pip-the-thankful-pumpkin",
    "title": "Pip the Thankful Pumpkin",
    "subtitle": "A Little Pumpkin With a Big Helping Heart",
    "coverImage": "assets/books/a-little-pumpkin.jpg",
    "description": "A tiny pumpkin. A big heart. A Thanksgiving story filled with kindness, gratitude, and friendship! Meet Pip, the smallest pumpkin in Maple Hill Farm’s pumpkin patch. Pip dreams of being important—but he thinks he’s too tiny to make a difference. When his friends need help, Pip discovers that even the smallest pumpkin can do BIG things!",
    "values": ["Gratitude", "Appreciation", "Mindfulness"],
    "purchaseLinks": {
      "amazon": "https://www.amazon.com/dp/B0G1K2GBJM"
    },
    "status": "published"
  },
  {
    "id": "baloo-big-sharing-adventure",
    "title": "Baloo’s Big Sharing Adventure",
    "subtitle": "A heartwarming story that teaches kids the joy of sharing and kindness",
    "coverImage": "assets/books/baloo-shares.jpg",
    "description": "A beautifully illustrated picture book for kids aged 3–5, full of color, warmth, and heart. When Baloo, a playful baby panda, finds a basket full of delicious berries, he doesn’t want to share them with anyone! But as he sees his forest friends go hungry, Baloo discovers that sharing not only makes others smile — it makes his heart feel full too",
    "values": ["Sharing", "Friendship", "Generosity"],
    "purchaseLinks": {
      "amazon": "https://www.amazon.com/dp/B0G1Q61QRM"
    },
    "status": "published"
  },
  {
    "id": "baloo-and-the-lost-star",
    "title": "Baloo and the Lost Star",
    "subtitle": "A bedtime adventure about kindness, teamwork, and wonder",
    "coverImage": "assets/books/thank-you-tree.png",
    "description": "When a tiny star falls from the sky, Baloo the bear and his forest friends set out on a magical nighttime journey to help it find its way home. Through glowing forests, windy meadows, and twinkling moonlight, they discover that kindness and teamwork shine brighter than any star in the sky.",
    "values": ["kindness", "Wonder", "teamwork"],
    "purchaseLinks": {
      "amazon": "https://www.amazon.com/dp/B0G2L3GGYQ"
    },
    "status": "published"
  },
  {
    "id": "the-star-that-led-to-love",
    "title": "The Star That Led to Love",
    "subtitle": "A Christmas Story About Baby Jesus",
    "coverImage": "assets/books/star-that-led-to-love.png",
    "description": "Celebrate the magic of Christmas through the gentle story of Jesus’ birth. On a peaceful night in Bethlehem, a bright star lights the sky and guides everyone—Mary, Joseph, shepherds, and even little animals—toward a tiny manger where baby Jesus is born.",
    "values": ["Christmas", "Jesus", "Celebration"],
    "purchaseLinks": {
      "amazon": "https://www.amazon.com/dp/B0G34D2RS2"
    },
    "status": "published"
  },
  {
    "id": "moxie-and-the-luminous-aheese-advanture",
    "title": "Moxie and the Luminous Cheese Advanture",
    "subtitle": "A Tale of Courage, Curiosity, and the Magic Within",
    "coverImage": "assets/books/moxie_cover.jpg",
    "description": "a brave little mouse from the bustling town of Cheddarville, on a magical journey that will warm every reader’s heart. When Moxie hears tales about a legendary “luminous cheese” said to bring joy to anyone who tastes it, she sets off on an adventure bigger than anything she’s ever imagined.",
    "values": ["Brave_Mouse", "Courage", "Strength"],
    "purchaseLinks": {
      "amazon": "https://www.amazon.com/dp/B0G2XMQFNG"
    },
    "status": "published"
  },
  {
    "id": "The Day The Pencils Went On Strike",
    "title": "The Day The Pencils Went On Strike",
    "subtitle": "A Bright and Heartwarming Story About Sharing, Creativity, and Kindness",
    "coverImage": "assets/books/pencil_went_to_strike.png",
    "description": "When Leo sits down for homework one sunny morning, he discovers something surprising inside his pencil case… all his pencils are on STRIKE",
    "values": ["Pencil", "Funny", "Children"],
    "purchaseLinks": {
      "amazon": "Coming Soon"
    },
    "status": "upcoming",
    "releaseDate": "Nov, 30 2025"
  }
]
