[
  {
    "id": "testimonial-1",
    "quote": "Dr. Agrawal's books have become bedtime favorites in our home. My children ask for them every night, and I love the conversations they spark about being kind and grateful.",
    "author": "Sarah Mitchell",
    "role": "Parent of two"
  },
  {
    "id": "testimonial-2",
    "quote": "As a kindergarten teacher, I use these books weekly. The stories are engaging, the lessons are clear, and the illustrations are absolutely beautiful!",
    "author": "Ms. Rodriguez",
    "role": "Kindergarten Teacher"
  },
  {
    "id": "testimonial-3",
    "quote": "What a treasure! These books teach values that last a lifetime. My grandchildren love the stories, and I love the positive messages.",
    "author": "Robert Chen",
    "role": "Grandfather and Educator"
  },
  {
    "id": "testimonial-4",
    "quote": "Finally, children's books that combine wonderful storytelling with meaningful life lessons. Dr. Agrawal has created something truly special.",
    "author": "Emily Johnson",
    "role": "Elementary School Librarian"
  },
  {
    "id": "testimonial-5",
    "quote": "My 5-year-old daughter now says 'thank you' for everything! These stories really do make a difference in how children see the world around them.",
    "author": "Jennifer Park",
    "role": "Parent"
  },
  {
    "id": "testimonial-6",
    "quote": "I've been a reading specialist for 20 years, and these are some of the best character-building books I've encountered. They belong in every classroom.",
    "author": "Dr. Marcus Thompson",
    "role": "Reading Specialist"
  },
  {
    "id": "testimonial-7",
    "quote": "The perfect gift for young readers! Beautifully written, wonderfully illustrated, and filled with heart. My nieces absolutely adore them.",
    "author": "Amanda Rodriguez",
    "role": "Aunt and Book Lover"
  },
  {
    "id": "testimonial-8",
    "quote": "These books have helped my students understand empathy and compassion in ways that lectures never could. Dr. Agrawal is a gifted storyteller.",
    "author": "Mr. David Williams",
    "role": "2nd Grade Teacher"
  },
  {
    "id": "testimonial-9",
    "quote": "I work with children who have behavioral challenges, and these books have been invaluable. The stories give us a common language to discuss feelings and choices.",
    "author": "Lisa Anderson",
    "role": "School Counselor"
  },
  {
    "id": "testimonial-10",
    "quote": "Beautiful stories with important messages. My son has learned so much about kindness and sharing. These are books we'll treasure forever.",
    "author": "Michael Brown",
    "role": "Father of three"
  },
  {
    "id": "testimonial-11",
    "quote": "As a homeschooling parent, I'm always looking for quality literature that teaches values. Dr. Agrawal's books are now a cornerstone of our curriculum.",
    "author": "Rebecca Stone",
    "role": "Homeschool Educator"
  },
  {
    "id": "testimonial-12",
    "quote": "These stories transcend age groups. Even my middle schoolers enjoy revisiting these books and discussing the deeper meanings behind each tale.",
    "author": "Karen Lee",
    "role": "Middle School Teacher"
  }
]
